/*
****************************************************************
* Вставить этот код в программу где надо вывести данные на LCD *
* =============================================================*
* lcd_init2();                                                 *
* lcd_init();                                                  *
* lcd_gotoxy(0,0);//Переходим в позицию LCD x=0, y=0           *
* lcd_putsf("Stroka_1");//Вывод на дисплей текста "Stroka_1"   *
* lcd_gotoxy(0,1);//Переходим в позицию LCD x=0, y=0           *
* lcd_putsf("Stroka_2");//Вывод на дисплей текста "Stroka_2"   *
****************************************************************
*/

#include "iostm8l152c6.h"
#include "stdio.h"
#include "menu.h"
#include "fm.h"
#include "clock.h"

#define RS  PE_ODR_bit.ODR0     //0-запись команд, 1-запись данных сигнал RD
#define E   PE_ODR_bit.ODR1     //Ввод данных по спадающему фронту сигнал Е
#define DB4 PE_ODR_bit.ODR3     //Определение линий 4-х битного интерфейса DB4
#define DB5 PE_ODR_bit.ODR2     //Определение линий 4-х битного интерфейса DB5
#define DB6 PE_ODR_bit.ODR5     //Определение линий 4-х битного интерфейса DB6
#define DB7 PE_ODR_bit.ODR4     //Определение линий 4-х битного интерфейса DB7

char buf1[16];
char buf2[16];

//*****************************************************************************
char time=30;                   //Базовая задержка времени для LCD(зависит от тактовой частоты MCU)
//Определение портов
void lcd_init2(void)
{
PE_DDR_bit.DDR0=1;              //Настройка сигнала RS бит 7 порта D на вывод 
PE_CR1_bit.C10=1;               //Установка регистра CR1 бит 7 порта D как "двухтактный выход"(см. Datasheet)
PE_DDR_bit.DDR1=1;              //Настройка сигнала Е бит 5 порта D на вывод 
PE_CR1_bit.C11=1;               //Установка регистра CR1 бит 5 порта D как "двухтактный выход"(см. Datasheet)
PE_DDR_bit.DDR3=1;              //Настройка сигнала DB4 бит 6 порта D на вывод  
PE_CR1_bit.C13=1;               //Установка регистра CR1 бит 6 порта D как "двухтактный выход"(см. Datasheet)
PE_DDR_bit.DDR2=1;              //Настройка сигнала DB5 бит 4 порта D на вывод 
PE_CR1_bit.C12=1;               //Установка регистра CR1 бит 4 порта D как "двухтактный выход"(см. Datasheet)
PE_DDR_bit.DDR5=1;              //Настройка сигнала DB5 бит 2 порта D на вывод 
PE_CR1_bit.C15=1;               //Установка регистра CR1 бит 2 порта D как "двухтактный выход"(см. Datasheet)
PE_DDR_bit.DDR4=1;              //Настройка сигнала DB6 бит 0 порта D на вывод 
PE_CR1_bit.C14=1;               //Установка регистра CR1 бит 0 порта D как "двухтактный выход"(см. Datasheet)
}
//*****************************************************************************
void delay(int a)               //Функция задержки
{
  int cnt;
  for (cnt=a; cnt>0; cnt--);
}
//*****************************************************************************
void lcd(char d)                //Функция записи команд/данных в LCD
 {E=1;
  DB7=(d&0x80)>>7;              //Выводим старший ниббл
  DB6=(d&0x40)>>6;
  DB5=(d&0x20)>>5;
  DB4=(d&0x10)>>4;
  delay(time);                  //Задержка
  E=0;                          //Запись
  delay(time);                  //Задержка
  E=1;                          //enable = 1
  DB7=(d&0x08)>>3;              //Выводим младший ниббл
  DB6=(d&0x04)>>2;
  DB5=(d&0x02)>>1;
  DB4=(d&0x01);
  delay(time);                  //Задержка
  E=0;                          //Запись
  delay(time);                  //Пауза для выполнения команды
 }
//*****************************************************************************
void lcd_com(char c)            //Фунция записи команд в LCD
{
  RS=0;                         //Режим записи "Команды"
  lcd(c);                       //Запись
}
//*****************************************************************************
void lcd_clear(void)            //Функция очистки LCD
{
  lcd_com(0x01); delay(time*100);//Очистка LCD
}
//*****************************************************************************
void lcd_init(void)             //Функция инициализации LCD
{delay(time*10);                //Предварительная задержка
 lcd_com(0x33); delay(time*50); //Подготовка
 lcd_com(0x32); lcd_com(0x28);  //4 бита, 2 строки
 lcd_com(0x08);                 //Выключение LCD
 lcd_clear();                   //Очистка LCD
 lcd_com(0x06);                 //Сдвиг курсора вправо
 lcd_com(0x0C);                 //Включение без курсора
 delay(time);                   //Пауза для выполнения команды
}
//*****************************************************************************
void lcd_putchar(char d)        //Функция записи данных в LCD
{
  RS=1;                         //Режим записи "Данные"
  lcd(d);                       //Запись
}
//*****************************************************************************
void lcd_putsf(char *_str)      //Функция вывода строки на LCD
{
  char data;
  while (*_str) {data=*_str++; lcd_putchar(data);}
}
//*****************************************************************************
void lcd_gotoxy(char x, char y) //Функция перехода в указанную позицию
{
  lcd_com((0x80+y*64)+x);       //Рассчет позиции. Ячейка 0х80 - лев. верхн. угол
}
//*****************************************************************************
void parsing (char* stroka_one,char* stroka_two,long int con1,long int con2)//Функция преобразования строки
{
  sprintf(buf1, stroka_one, con1); //Первая переменная из массива buf1  
  sprintf(buf2, stroka_two, con2);   //Вторая переменная из массива buf2
}
//*****************************************************************************
void parsingfm (char* fm_stroka_one,char* fm_stroka_two,int fm_con1,float fm_con2)//Функция преобразования строки
{
  sprintf(buf1, fm_stroka_one, fm_con1); //Первая переменная из массива buf1  
  sprintf(buf2, fm_stroka_two, fm_con2);   //Вторая переменная из массива buf2
}
//*****************************************************************************
void parsing_clock (char* clock_one,char* clock_two,unsigned int clock1,unsigned int clock2,unsigned int clock3,unsigned int data_1,unsigned int data_2,unsigned int data_3)//Функция преобразования строки
{
  sprintf(buf1, clock_one, clock3,clock2,clock1); //Первая переменная из массива buf1  
  sprintf(buf2, clock_two, data_1,data_2,data_3);   //Вторая переменная из массива buf2
}